export default {
  data: () => ({
		rules: {
			required: v => !!v || 'Обязательное поле',
			counter: v => v ? v.length <= 100 || 'Максимум 100 символов' : true,
      email: v => {
				const pattern = /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/
        return pattern.test(v) || 'Укажите коррекный e-mail'
      },
			date: v => new Date(v) < new Date() || 'Укажите корректную дату рождения'
    }
  })
}